Revit 2026 API

# WorksharingUtilsCheckoutWorksets(Document, ICollectionWorksetId) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ICollection<WorksetId> CheckoutWorksets(
	Document document,
	ICollection<WorksetId> worksetsToCheckout
)
```
```vb
Public Shared Function CheckoutWorksets (
	document As Document,
	worksetsToCheckout As ICollection(Of WorksetId)
) As ICollection(Of WorksetId)
```
```cpp
public:
static ICollection<WorksetId^>^ CheckoutWorksets(
	Document^ document,
	ICollection<WorksetId^>^ worksetsToCheckout
)
```
```fsharp
static member CheckoutWorksets :
        document : Document *
        worksetsToCheckout : ICollection<WorksetId> -> ICollection<WorksetId>
```

#### Parameters

document Document

worksetsToCheckout ICollectionWorksetId

#### Return Value

ICollectionWorksetId

#### Reference

WorksharingUtils Class

CheckoutWorksets Overload

Autodesk.Revit.DB Namespace